{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "Имеется файл с данными по успеваемости абитуриентов. Он представляет из себя набор строк, где в каждой строке записана следующая информация:\n",
    "\n",
    "Фамилия;Оценка_по_математике;Оценка_по_физике;Оценка_по_русскому_языку\n",
    "\n",
    "Поля внутри строки разделены точкой с запятой, оценки — целые числа.\n",
    "\n",
    "Напишите программу, которая считывает файл с подобной структурой и для каждого абитуриента выводит его среднюю оценку по этим трём предметам на отдельной строке, соответствующей этому абитуриенту.\n",
    "\n",
    "Также в конце файла, на отдельной строке, через пробел запишите средние баллы по математике, физике и русскому языку по всем абитуриентам:\n",
    "\n",
    "Примечание. Для разбиения строки на части по символу ';' можно использовать метод split следующим образом: \n",
    "\n",
    "print('First;Second-1 Second-2;Third'.split(';'))\n",
    "\n",
    "# ['First', 'Second-1 Second-2', 'Third']\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "Петров;85;92;78\n",
    "Сидоров;100;88;94\n",
    "Иванов;58;72;85\n",
    "Sample Output:\n",
    "\n",
    "85.0\n",
    "94.0\n",
    "71.666666667\n",
    "81.0 84.0 85.666666667"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open (r'C:\\Users\\loshkarev-vm\\Desktop\\dataset_3363_4.txt', 'r', encoding='utf-8') as s:\n",
    "    l = s.readline().split(';')                      # считываю из файла одну строку, чтобы узнать ее длину, для создания пустого списка\n",
    "    m = [0 for i in range(1, len(l))]                # создаю пустой список, в который буду записывать суммы по каждому предмету всех уч-ков\n",
    "    n = 0                                            # эта переменная будет считать количество строк в датасете\n",
    "    for line in s:                                   # циклом иду и читаю строку за строкой\n",
    "        line = line.split(';')                       # прочитанную строку разделяю split-ом       \n",
    "        z = 0                                        # эта переменная будет записывать сумму баллов для одного ученика по всем предметам      \n",
    "        for i in range(1, len(line)):                # циклом иду по строке и вычитываю каждую оценку \n",
    "            z += int(line[i])                        # плюсую оценки для одного ученика (напр, 85+92+78)\n",
    "            m[i - 1] += int(line[i])                 # здесь в список плюсую оценки по каждому предмету для всех учеников [оц1, оц2, оц3]\n",
    "        y = (z / (len(line)-1))                      # считаю среднее для одного ученика по всем его оценкам\n",
    "        n += 1                                       # здесь происходит подсчет прочитанной строки\n",
    "        print(\"%.8f\" % y)                            # вывожу инфо о среднем балле ученика ((\"%.8f\" % y) задает точность после нуля)\n",
    "    for i in m:                                      # циклом иду по списку всех сумм оценок всех учеников\n",
    "        print(\"%.8f\" % (i / n), end=' ')             # вывожу среднее по предметам  всех учеников\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
