{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Напишите программу, которая принимает на стандартный вход список игр футбольных команд с результатом матча и выводит на стандартный вывод сводную таблицу результатов всех матчей.\n",
    "\n",
    "За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.\n",
    "\n",
    "Формат ввода следующий:\n",
    "В первой строке указано целое число n — количество завершенных игр.\n",
    "После этого идет n строк, в которых записаны результаты игры в следующем формате:\n",
    "Первая_команда;Забито_первой_командой;Вторая_команда;Забито_второй_командой\n",
    "\n",
    "Вывод программы необходимо оформить следующим образом:\n",
    "Команда:Всего_игр Побед Ничьих Поражений Всего_очков\n",
    "\n",
    "Конкретный пример ввода-вывода приведён ниже.\n",
    "\n",
    "Порядок вывода команд произвольный.\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "3\n",
    "Зенит;3;Спартак;1\n",
    "Спартак;1;ЦСКА;1\n",
    "ЦСКА;0;Зенит;2\n",
    "Sample Output:\n",
    "\n",
    "Зенит:2 2 0 0 6\n",
    "ЦСКА:2 0 1 1 1\n",
    "Спартак:2 0 1 1 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "tableRes = {}\n",
    "while n != 0:\n",
    "    gameRes = input().split(';')\n",
    "    if gameRes[1] > gameRes[3]:\n",
    "        res1 = 3\n",
    "        res2 = 0\n",
    "    elif gameRes[1] == gameRes[3]:\n",
    "        res1 = 1\n",
    "        res2 = 1\n",
    "    else:\n",
    "        res1 = 0\n",
    "        res2 = 3\n",
    "    if gameRes[0] in tableRes and gameRes[2] not in tableRes:\n",
    "        tableRes[gameRes[0]].append(res1)\n",
    "        tableRes.update({gameRes[2]:[res2]})\n",
    "    elif gameRes[0] not in tableRes and gameRes[2] in tableRes:\n",
    "        tableRes[gameRes[2]].append(res2)\n",
    "        tableRes.update({gameRes[0]:[res1]})\n",
    "    elif gameRes[0] in tableRes and gameRes[2] in tableRes:\n",
    "        tableRes[gameRes[0]].append(res1)\n",
    "        tableRes[gameRes[2]].append(res2)\n",
    "    else:\n",
    "        tableRes.update({gameRes[0]:[res1], gameRes[2]:[res2]})\n",
    "    n -= 1\n",
    "for key in tableRes:\n",
    "    count, win, draw, lose = 0, 0, 0, 0\n",
    "    s = tableRes[key]\n",
    "    for i in range(len(s)):\n",
    "        count += s[i]\n",
    "        if len(s) > 1:\n",
    "            if s[i] == 3:\n",
    "                win += 1\n",
    "            elif s[i] == 1:\n",
    "                draw += 1\n",
    "            else:\n",
    "                lose += 1\n",
    "        elif len(s) == 1:\n",
    "            if s[i] == 3:\n",
    "                win += 1\n",
    "            elif s[i] == 1:\n",
    "                draw += 1\n",
    "            else:\n",
    "                lose += 1\n",
    "    print(key + ':', len(s), win, draw, lose, count)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
